In [2]:
import numpy as np
import pandas as pd

In [4]:
data=np.random.randn(4,3)

In [5]:
dataFrame=pd.DataFrame(data)

In [6]:
dataFrame

          0         1         2
0 -1.445361  0.112030 -0.290827
1 -1.215152 -0.248900  0.452104
2 -1.314880 -0.232730  0.583782
3 -0.656862 -0.580067 -2.549265

In [7]:
dataFrame["Emeklilik yasi"]=dataFrame[1]

In [8]:
dataFrame

          0         1         2  Emeklilik yasi
0 -1.445361  0.112030 -0.290827        0.112030
1 -1.215152 -0.248900  0.452104       -0.248900
2 -1.314880 -0.232730  0.583782       -0.232730
3 -0.656862 -0.580067 -2.549265       -0.580067

In [9]:
dataFrame.drop(1,axis=1)

          0         2  Emeklilik yasi
0 -1.445361 -0.290827        0.112030
1 -1.215152  0.452104       -0.248900
2 -1.314880  0.583782       -0.232730
3 -0.656862 -2.549265       -0.580067

In [10]:
dataFrame.drop(2,axis=0)

          0         1         2  Emeklilik yasi
0 -1.445361  0.112030 -0.290827        0.112030
1 -1.215152 -0.248900  0.452104       -0.248900
3 -0.656862 -0.580067 -2.549265       -0.580067

In [11]:
dataFrame

          0         1         2  Emeklilik yasi
0 -1.445361  0.112030 -0.290827        0.112030
1 -1.215152 -0.248900  0.452104       -0.248900
2 -1.314880 -0.232730  0.583782       -0.232730
3 -0.656862 -0.580067 -2.549265       -0.580067

In [12]:
dataFrame<0

      0      1      2  Emeklilik yasi
0  True  False   True           False
1  True   True  False            True
2  True   True  False            True
3  True   True   True            True

In [14]:
dataFrame[dataFrame[1]>0]

          0        1         2  Emeklilik yasi
0 -1.445361  0.11203 -0.290827         0.11203

In [23]:

yeniIndexListesi=["Omer","Mustafa","2","4"]
dataFrame["Yeni Indeks"]=yeniIndexListesi
dataFrame.set_index("Yeni Indeks")

                    0         1         2  Emeklilik yasi
Yeni Indeks
Omer        -1.445361  0.112030 -0.290827        0.112030
Mustafa     -1.215152 -0.248900  0.452104       -0.248900
2           -1.314880 -0.232730  0.583782       -0.232730
4           -0.656862 -0.580067 -2.549265       -0.580067

                    0         1         2  Emeklilik yasi
Yeni Indeks
Omer        -1.445361  0.112030 -0.290827        0.112030
Mustafa     -1.215152 -0.248900  0.452104       -0.248900
2           -1.314880 -0.232730  0.583782       -0.232730
4           -0.656862 -0.580067 -2.549265       -0.580067

## multi index

In [24]:
ilkIndeksler=["Simpson","Simpson","Simpson","South Park","South Park","South Park"]
icIndeksler=["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [25]:
birlesmisIndex=list(zip(ilkIndeksler,icIndeksler))

In [29]:
birlesmisIndex=pd.MultiIndex.from_tuples(birlesmisIndex)

In [30]:
birlesmisIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [32]:
benimListem=[[1,"a"],[2,"b"],[3,"c"],[4,"d"],[5,"e"],[6,"f"]]

In [33]:
benimDizim=np.array(benimListem)

In [36]:
dataFrame=pd.DataFrame(benimDizim,index=birlesmisIndex,columns=["Yas","Meslek"])

In [44]:
dataFrame

                   Yas Meslek
Simpson    Homer     1      a
           Bart      2      b
           Marge     3      c
South Park Cartman   4      d
           Kenny     5      e
           Kyle      6      f

In [46]:
dataFrame.loc["South Park"]

        Yas Meslek
Cartman   4      d
Kenny     5      e
Kyle      6      f